In [1]:
import pandas as pd
import numpy as np

A Multiply Indexed Series

The bad way

In [2]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index = index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [3]:
pop[('California',2010):('Texas',2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [4]:
pop[[i for i in pop.index if i[1]==2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

The Better Way: Pandas MultiIndex

In [5]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [6]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [10]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [11]:
pd.DataFrame(pop)

                        0
California 2000  33871648
           2010  37253956
New York   2000  18976457
           2010  19378102
Texas      2000  20851820
           2010  25145561

MultiIndex as extra dimension

In [12]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [13]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [14]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [15]:
f_u18 = pop_df['under18']/pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

Methods of MultiIndex Creation

In [16]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.324111  0.139941
  2  0.670875  0.829330
b 1  0.108508  0.212789
  2  0.372226  0.276916

In [18]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

Explicit MultiIndex constructors

In [19]:
pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [20]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [21]:
pd.MultiIndex.from_product([['a','b'],[1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

MultiIndex level names

In [31]:
pop.index.names = ['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

MultiIndex for columns

In [22]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

In [23]:
#mock some data
data = np.round(np.random.randn(4,6),1)
data[:,::2]*=10
data+=37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      41.0  37.2  37.0  37.6  43.0  35.9
     2      38.0  37.0  45.0  36.5  49.0  35.7
2014 1      39.0  37.9  20.0  36.9  42.0  36.4
     2      34.0  36.5  26.0  37.3  32.0  35.9

In [24]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      37.0  37.6
     2      45.0  36.5
2014 1      20.0  36.9
     2      26.0  37.3

Indexing and Slicing a MultiIndex

Multiply indexed Series

In [25]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [26]:
pop['California', 2000]

33871648

In [27]:
pop['California']

2000    33871648
2010    37253956
dtype: int64

In [28]:
pop.loc['California':'New York']

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [29]:
pop[:, 2000]

California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [ ]:
pop[pop > 22000000]

In [32]:
pop[['California', 'Texas']]

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

Multiply indexed DataFrames

In [33]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      41.0  37.2  37.0  37.6  43.0  35.9
     2      38.0  37.0  45.0  36.5  49.0  35.7
2014 1      39.0  37.9  20.0  36.9  42.0  36.4
     2      34.0  36.5  26.0  37.3  32.0  35.9

In [34]:
health_data['Guido', 'HR']

year  visit
2013  1        37.0
      2        45.0
2014  1        20.0
      2        26.0
Name: (Guido, HR), dtype: float64

In [35]:
health_data.iloc[:2,:2]

subject      Bob
type          HR  Temp
year visit
2013 1      41.0  37.2
     2      38.0  37.0

In [36]:
health_data.loc[:, ('Bob','HR')]

year  visit
2013  1        41.0
      2        38.0
2014  1        39.0
      2        34.0
Name: (Bob, HR), dtype: float64

In [38]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      41.0  37.2  37.0  37.6  43.0  35.9
     2      38.0  37.0  45.0  36.5  49.0  35.7
2014 1      39.0  37.9  20.0  36.9  42.0  36.4
     2      34.0  36.5  26.0  37.3  32.0  35.9

In [41]:
health_data.loc[:, ('Bob', ('HR','Temp'))]

subject      Bob
type          HR  Temp
year visit
2013 1      41.0  37.2
     2      38.0  37.0
2014 1      39.0  37.9
     2      34.0  36.5

In [42]:
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: invalid syntax (<ipython-input-42-fb34fa30ac09>, line 1)

In [43]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      41.0  37.0  43.0
2014 1      39.0  20.0  42.0

Rearranging Multi-Indices

Sorted and unsorted indices

In [45]:
index = pd.MultiIndex.from_product([['a','c','b'], [1,2]])
data = pd.Series(np.random.rand(6), index = index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.678787
      2      0.078835
c     1      0.437939
      2      0.998524
b     1      0.338762
      2      0.227759
dtype: float64

In [47]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [48]:
data = data.sort_index()
data

char  int
a     1      0.678787
      2      0.078835
b     1      0.338762
      2      0.227759
c     1      0.437939
      2      0.998524
dtype: float64

In [49]:
data['a':'b']

char  int
a     1      0.678787
      2      0.078835
b     1      0.338762
      2      0.227759
dtype: float64

Stacking and unstacking indices

In [50]:
pop.unstack(level = 0)

      California  New York     Texas
2000    33871648  18976457  20851820
2010    37253956  19378102  25145561

In [51]:
pop.unstack(level = 1) # Equal to pop.unstack(level = 0).T

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [53]:
pop.unstack().stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

Index setting and resetting

In [54]:
pop_flat = pop.reset_index(name = 'population')
pop_flat

      level_0  level_1  population
0  California     2000    33871648
1  California     2010    37253956
2    New York     2000    18976457
3    New York     2010    19378102
4       Texas     2000    20851820
5       Texas     2010    25145561

In [55]:
pop_flat.set_index(['state', 'year'])

KeyError: "None of ['state', 'year'] are in the columns"

Data Aggregations on Multi-Indices

In [57]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      41.0  37.2  37.0  37.6  43.0  35.9
     2      38.0  37.0  45.0  36.5  49.0  35.7
2014 1      39.0  37.9  20.0  36.9  42.0  36.4
     2      34.0  36.5  26.0  37.3  32.0  35.9

In [58]:
data_mean = health_data.mean(level = 'year')
data_mean

subject   Bob       Guido          Sue
type       HR  Temp    HR   Temp    HR   Temp
year
2013     39.5  37.1  41.0  37.05  46.0  35.80
2014     36.5  37.2  23.0  37.10  37.0  36.15

In [59]:
data_mean.mean(axis = 1, level = 'type')

type         HR       Temp
year
2013  42.166667  36.650000
2014  32.166667  36.816667